benchmark/results/stresstest.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stresstest.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 2m20s max duration (incl. graceful stop):
              * default: Up to 40 looping VUs for 1m50s over 6 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/40 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/40 VUs  0m01.0s/1m50.0s

running (0m02.0s), 01/40 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 01/40 VUs  0m02.0s/1m50.0s

running (0m03.0s), 01/40 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 01/40 VUs  0m03.0s/1m50.0s

running (0m04.0s), 01/40 VUs, 4 complete and 0 interrupted iterations
default   [   4% ] 01/40 VUs  0m04.0s/1m50.0s

running (0m05.0s), 01/40 VUs, 5 complete and 0 interrupted iterations
default   [   5% ] 01/40 VUs  0m05.0s/1m50.0s

running (0m06.0s), 02/40 VUs, 8 complete and 0 interrupted iterations
default   [   5% ] 02/40 VUs  0m06.0s/1m50.0s

running (0m07.0s), 02/40 VUs, 10 complete and 0 interrupted iterations
default   [   6% ] 02/40 VUs  0m07.0s/1m50.0s

running (0m08.0s), 02/40 VUs, 12 complete and 0 interrupted iterations
default   [   7% ] 02/40 VUs  0m08.0s/1m50.0s

running (0m09.0s), 02/40 VUs, 16 complete and 0 interrupted iterations
default   [   8% ] 02/40 VUs  0m09.0s/1m50.0s

running (0m10.0s), 02/40 VUs, 19 complete and 0 interrupted iterations
default   [   9% ] 02/40 VUs  0m10.0s/1m50.0s

running (0m11.0s), 03/40 VUs, 21 complete and 0 interrupted iterations
default   [  10% ] 03/40 VUs  0m11.0s/1m50.0s

running (0m12.0s), 03/40 VUs, 24 complete and 0 interrupted iterations
default   [  11% ] 03/40 VUs  0m12.0s/1m50.0s

running (0m13.0s), 03/40 VUs, 26 complete and 0 interrupted iterations
default   [  12% ] 03/40 VUs  0m13.0s/1m50.0s

running (0m14.0s), 03/40 VUs, 28 complete and 0 interrupted iterations
default   [  13% ] 03/40 VUs  0m14.0s/1m50.0s

running (0m15.0s), 03/40 VUs, 31 complete and 0 interrupted iterations
default   [  14% ] 03/40 VUs  0m15.0s/1m50.0s

running (0m16.0s), 04/40 VUs, 33 complete and 0 interrupted iterations
default   [  15% ] 04/40 VUs  0m16.0s/1m50.0s

running (0m17.0s), 04/40 VUs, 36 complete and 0 interrupted iterations
default   [  15% ] 04/40 VUs  0m17.0s/1m50.0s

running (0m18.0s), 04/40 VUs, 38 complete and 0 interrupted iterations
default   [  16% ] 04/40 VUs  0m18.0s/1m50.0s

running (0m19.0s), 04/40 VUs, 40 complete and 0 interrupted iterations
default   [  17% ] 04/40 VUs  0m19.0s/1m50.0s

running (0m20.0s), 04/40 VUs, 42 complete and 0 interrupted iterations
default   [  18% ] 04/40 VUs  0m20.0s/1m50.0s

running (0m21.0s), 05/40 VUs, 46 complete and 0 interrupted iterations
default   [  19% ] 05/40 VUs  0m21.0s/1m50.0s

running (0m22.0s), 05/40 VUs, 49 complete and 0 interrupted iterations
default   [  20% ] 05/40 VUs  0m22.0s/1m50.0s

running (0m23.0s), 05/40 VUs, 51 complete and 0 interrupted iterations
default   [  21% ] 05/40 VUs  0m23.0s/1m50.0s

running (0m24.0s), 05/40 VUs, 53 complete and 0 interrupted iterations
default   [  22% ] 05/40 VUs  0m24.0s/1m50.0s

running (0m25.0s), 06/40 VUs, 56 complete and 0 interrupted iterations
default   [  23% ] 06/40 VUs  0m25.0s/1m50.0s

running (0m26.0s), 06/40 VUs, 59 complete and 0 interrupted iterations
default   [  24% ] 06/40 VUs  0m26.0s/1m50.0s

running (0m27.0s), 06/40 VUs, 62 complete and 0 interrupted iterations
default   [  25% ] 06/40 VUs  0m27.0s/1m50.0s

running (0m28.0s), 06/40 VUs, 66 complete and 0 interrupted iterations
default   [  25% ] 06/40 VUs  0m28.0s/1m50.0s

running (0m29.0s), 07/40 VUs, 68 complete and 0 interrupted iterations
default   [  26% ] 07/40 VUs  0m29.0s/1m50.0s

running (0m30.0s), 07/40 VUs, 69 complete and 0 interrupted iterations
default   [  27% ] 07/40 VUs  0m30.0s/1m50.0s

running (0m31.0s), 07/40 VUs, 70 complete and 0 interrupted iterations
default   [  28% ] 07/40 VUs  0m31.0s/1m50.0s

running (0m32.0s), 07/40 VUs, 70 complete and 0 interrupted iterations
default   [  29% ] 07/40 VUs  0m32.0s/1m50.0s

running (0m33.0s), 08/40 VUs, 71 complete and 0 interrupted iterations
default   [  30% ] 08/40 VUs  0m33.0s/1m50.0s

running (0m34.0s), 08/40 VUs, 71 complete and 0 interrupted iterations
default   [  31% ] 08/40 VUs  0m34.0s/1m50.0s

running (0m35.0s), 08/40 VUs, 71 complete and 0 interrupted iterations
default   [  32% ] 08/40 VUs  0m35.0s/1m50.0s

running (0m36.0s), 08/40 VUs, 71 complete and 0 interrupted iterations
default   [  33% ] 08/40 VUs  0m36.0s/1m50.0s

running (0m37.0s), 09/40 VUs, 72 complete and 0 interrupted iterations
default   [  34% ] 09/40 VUs  0m37.0s/1m50.0s

running (0m38.0s), 09/40 VUs, 72 complete and 0 interrupted iterations
default   [  35% ] 09/40 VUs  0m38.0s/1m50.0s

running (0m39.0s), 09/40 VUs, 74 complete and 0 interrupted iterations
default   [  35% ] 09/40 VUs  0m39.0s/1m50.0s

running (0m40.0s), 09/40 VUs, 77 complete and 0 interrupted iterations
default   [  36% ] 09/40 VUs  0m40.0s/1m50.0s

running (0m41.0s), 10/40 VUs, 79 complete and 0 interrupted iterations
default   [  37% ] 10/40 VUs  0m41.0s/1m50.0s

running (0m42.0s), 10/40 VUs, 82 complete and 0 interrupted iterations
default   [  38% ] 10/40 VUs  0m42.0s/1m50.0s

running (0m43.0s), 11/40 VUs, 86 complete and 0 interrupted iterations
default   [  39% ] 11/40 VUs  0m43.0s/1m50.0s

running (0m44.0s), 11/40 VUs, 88 complete and 0 interrupted iterations
default   [  40% ] 11/40 VUs  0m44.0s/1m50.0s

running (0m45.0s), 12/40 VUs, 91 complete and 0 interrupted iterations
default   [  41% ] 12/40 VUs  0m45.0s/1m50.0s

running (0m46.0s), 12/40 VUs, 95 complete and 0 interrupted iterations
default   [  42% ] 12/40 VUs  0m46.0s/1m50.0s

running (0m47.0s), 13/40 VUs, 97 complete and 0 interrupted iterations
default   [  43% ] 13/40 VUs  0m47.0s/1m50.0s

running (0m48.0s), 13/40 VUs, 100 complete and 0 interrupted iterations
default   [  44% ] 13/40 VUs  0m48.0s/1m50.0s

running (0m49.0s), 14/40 VUs, 103 complete and 0 interrupted iterations
default   [  45% ] 14/40 VUs  0m49.0s/1m50.0s

running (0m50.0s), 14/40 VUs, 105 complete and 0 interrupted iterations
default   [  45% ] 14/40 VUs  0m50.0s/1m50.0s

running (0m51.0s), 15/40 VUs, 109 complete and 0 interrupted iterations
default   [  46% ] 15/40 VUs  0m51.0s/1m50.0s

running (0m52.0s), 15/40 VUs, 112 complete and 0 interrupted iterations
default   [  47% ] 15/40 VUs  0m52.0s/1m50.0s

running (0m53.0s), 16/40 VUs, 114 complete and 0 interrupted iterations
default   [  48% ] 16/40 VUs  0m53.0s/1m50.0s

running (0m54.0s), 16/40 VUs, 118 complete and 0 interrupted iterations
default   [  49% ] 16/40 VUs  0m54.0s/1m50.0s

running (0m55.0s), 17/40 VUs, 120 complete and 0 interrupted iterations
default   [  50% ] 17/40 VUs  0m55.0s/1m50.0s

running (0m56.0s), 17/40 VUs, 124 complete and 0 interrupted iterations
default   [  51% ] 17/40 VUs  0m56.0s/1m50.0s

running (0m57.0s), 18/40 VUs, 126 complete and 0 interrupted iterations
default   [  52% ] 18/40 VUs  0m57.0s/1m50.0s

running (0m58.0s), 18/40 VUs, 129 complete and 0 interrupted iterations
default   [  53% ] 18/40 VUs  0m58.0s/1m50.0s

running (0m59.0s), 19/40 VUs, 132 complete and 0 interrupted iterations
default   [  54% ] 19/40 VUs  0m59.0s/1m50.0s

running (1m00.0s), 19/40 VUs, 135 complete and 0 interrupted iterations
default   [  55% ] 19/40 VUs  1m00.0s/1m50.0s

running (1m01.0s), 20/40 VUs, 138 complete and 0 interrupted iterations
default   [  55% ] 20/40 VUs  1m01.0s/1m50.0s

running (1m02.0s), 20/40 VUs, 141 complete and 0 interrupted iterations
default   [  56% ] 20/40 VUs  1m02.0s/1m50.0s

running (1m03.0s), 21/40 VUs, 144 complete and 0 interrupted iterations
default   [  57% ] 21/40 VUs  1m03.0s/1m50.0s

running (1m04.0s), 21/40 VUs, 146 complete and 0 interrupted iterations
default   [  58% ] 21/40 VUs  1m04.0s/1m50.0s

running (1m05.0s), 22/40 VUs, 149 complete and 0 interrupted iterations
default   [  59% ] 22/40 VUs  1m05.0s/1m50.0s

running (1m06.0s), 22/40 VUs, 152 complete and 0 interrupted iterations
default   [  60% ] 22/40 VUs  1m06.0s/1m50.0s

running (1m07.0s), 23/40 VUs, 154 complete and 0 interrupted iterations
default   [  61% ] 23/40 VUs  1m07.0s/1m50.0s

running (1m08.0s), 23/40 VUs, 157 complete and 0 interrupted iterations
default   [  62% ] 23/40 VUs  1m08.0s/1m50.0s

running (1m09.0s), 24/40 VUs, 159 complete and 0 interrupted iterations
default   [  63% ] 24/40 VUs  1m09.0s/1m50.0s

running (1m10.0s), 24/40 VUs, 161 complete and 0 interrupted iterations
default   [  64% ] 24/40 VUs  1m10.0s/1m50.0s

running (1m11.0s), 25/40 VUs, 165 complete and 0 interrupted iterations
default   [  65% ] 25/40 VUs  1m11.0s/1m50.0s

running (1m12.0s), 25/40 VUs, 168 complete and 0 interrupted iterations
default   [  65% ] 25/40 VUs  1m12.0s/1m50.0s

running (1m13.0s), 26/40 VUs, 170 complete and 0 interrupted iterations
default   [  66% ] 26/40 VUs  1m13.0s/1m50.0s

running (1m14.0s), 26/40 VUs, 173 complete and 0 interrupted iterations
default   [  67% ] 26/40 VUs  1m14.0s/1m50.0s

running (1m15.0s), 27/40 VUs, 176 complete and 0 interrupted iterations
default   [  68% ] 27/40 VUs  1m15.0s/1m50.0s

running (1m16.0s), 27/40 VUs, 180 complete and 0 interrupted iterations
default   [  69% ] 27/40 VUs  1m16.0s/1m50.0s

running (1m17.0s), 28/40 VUs, 182 complete and 0 interrupted iterations
default   [  70% ] 28/40 VUs  1m17.0s/1m50.0s

running (1m18.0s), 28/40 VUs, 186 complete and 0 interrupted iterations
default   [  71% ] 28/40 VUs  1m18.0s/1m50.0s

running (1m19.0s), 29/40 VUs, 189 complete and 0 interrupted iterations
default   [  72% ] 29/40 VUs  1m19.0s/1m50.0s

running (1m20.0s), 29/40 VUs, 192 complete and 0 interrupted iterations
default   [  73% ] 29/40 VUs  1m20.0s/1m50.0s

running (1m21.0s), 30/40 VUs, 195 complete and 0 interrupted iterations
default   [  74% ] 30/40 VUs  1m21.0s/1m50.0s

running (1m22.0s), 30/40 VUs, 197 complete and 0 interrupted iterations
default   [  75% ] 30/40 VUs  1m22.0s/1m50.0s

running (1m23.0s), 31/40 VUs, 200 complete and 0 interrupted iterations
default   [  75% ] 31/40 VUs  1m23.0s/1m50.0s

running (1m24.0s), 31/40 VUs, 202 complete and 0 interrupted iterations
default   [  76% ] 31/40 VUs  1m24.0s/1m50.0s

running (1m25.0s), 32/40 VUs, 204 complete and 0 interrupted iterations
default   [  77% ] 32/40 VUs  1m25.0s/1m50.0s

running (1m26.0s), 32/40 VUs, 208 complete and 0 interrupted iterations
default   [  78% ] 32/40 VUs  1m26.0s/1m50.0s

running (1m27.0s), 33/40 VUs, 210 complete and 0 interrupted iterations
default   [  79% ] 33/40 VUs  1m27.0s/1m50.0s

running (1m28.0s), 33/40 VUs, 213 complete and 0 interrupted iterations
default   [  80% ] 33/40 VUs  1m28.0s/1m50.0s

running (1m29.0s), 34/40 VUs, 217 complete and 0 interrupted iterations
default   [  81% ] 34/40 VUs  1m29.0s/1m50.0s

running (1m30.0s), 34/40 VUs, 222 complete and 0 interrupted iterations
default   [  82% ] 34/40 VUs  1m30.0s/1m50.0s

running (1m31.0s), 35/40 VUs, 224 complete and 0 interrupted iterations
default   [  83% ] 35/40 VUs  1m31.0s/1m50.0s

running (1m32.0s), 35/40 VUs, 227 complete and 0 interrupted iterations
default   [  84% ] 35/40 VUs  1m32.0s/1m50.0s

running (1m33.0s), 36/40 VUs, 229 complete and 0 interrupted iterations
default   [  85% ] 36/40 VUs  1m33.0s/1m50.0s

running (1m34.0s), 36/40 VUs, 233 complete and 0 interrupted iterations
default   [  85% ] 36/40 VUs  1m34.0s/1m50.0s

running (1m35.0s), 37/40 VUs, 238 complete and 0 interrupted iterations
default   [  86% ] 37/40 VUs  1m35.0s/1m50.0s

running (1m36.0s), 37/40 VUs, 241 complete and 0 interrupted iterations
default   [  87% ] 37/40 VUs  1m36.0s/1m50.0s

running (1m37.0s), 38/40 VUs, 243 complete and 0 interrupted iterations
default   [  88% ] 38/40 VUs  1m37.0s/1m50.0s

running (1m38.0s), 38/40 VUs, 246 complete and 0 interrupted iterations
default   [  89% ] 38/40 VUs  1m38.0s/1m50.0s

running (1m39.0s), 39/40 VUs, 250 complete and 0 interrupted iterations
default   [  90% ] 39/40 VUs  1m39.0s/1m50.0s

running (1m40.0s), 39/40 VUs, 253 complete and 0 interrupted iterations
default   [  91% ] 39/40 VUs  1m40.0s/1m50.0s

running (1m41.0s), 40/40 VUs, 255 complete and 0 interrupted iterations
default   [  92% ] 40/40 VUs  1m41.0s/1m50.0s

running (1m42.0s), 39/40 VUs, 257 complete and 0 interrupted iterations
default   [  93% ] 39/40 VUs  1m42.0s/1m50.0s

running (1m43.0s), 38/40 VUs, 261 complete and 0 interrupted iterations
default   [  94% ] 38/40 VUs  1m43.0s/1m50.0s

running (1m44.0s), 36/40 VUs, 264 complete and 0 interrupted iterations
default   [  95% ] 36/40 VUs  1m44.0s/1m50.0s

running (1m45.0s), 35/40 VUs, 266 complete and 0 interrupted iterations
default   [  95% ] 35/40 VUs  1m45.0s/1m50.0s

running (1m46.0s), 33/40 VUs, 269 complete and 0 interrupted iterations
default   [  96% ] 33/40 VUs  1m46.0s/1m50.0s

running (1m47.0s), 32/40 VUs, 271 complete and 0 interrupted iterations
default   [  97% ] 32/40 VUs  1m47.0s/1m50.0s

running (1m48.0s), 31/40 VUs, 272 complete and 0 interrupted iterations
default   [  98% ] 31/40 VUs  1m48.0s/1m50.0s

running (1m49.0s), 29/40 VUs, 274 complete and 0 interrupted iterations
default   [  99% ] 29/40 VUs  1m49.0s/1m50.0s

running (1m50.0s), 29/40 VUs, 275 complete and 0 interrupted iterations
default   [ 100% ] 29/40 VUs  1m50.0s/1m50.0s

running (1m51.0s), 27/40 VUs, 277 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (1m52.0s), 26/40 VUs, 278 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (1m53.0s), 25/40 VUs, 279 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (1m54.0s), 23/40 VUs, 281 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (1m55.0s), 22/40 VUs, 282 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (1m56.0s), 21/40 VUs, 283 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (1m57.0s), 19/40 VUs, 285 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (1m58.0s), 18/40 VUs, 286 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (1m59.0s), 17/40 VUs, 287 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m00.0s), 16/40 VUs, 288 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m01.0s), 14/40 VUs, 290 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m02.0s), 13/40 VUs, 291 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m03.0s), 12/40 VUs, 292 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m04.0s), 10/40 VUs, 294 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m05.0s), 09/40 VUs, 295 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m06.0s), 08/40 VUs, 296 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m07.0s), 07/40 VUs, 297 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m08.0s), 05/40 VUs, 299 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m09.0s), 05/40 VUs, 299 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m10.0s), 03/40 VUs, 301 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m11.0s), 02/40 VUs, 302 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s

running (2m12.0s), 01/40 VUs, 303 complete and 0 interrupted iterations
default ↓ [ 100% ] 29/40 VUs  1m50s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95) < 8000' p(95)=25.39s

    http_req_failed
    ✓ 'rate < 0.05' rate=0.00%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=7.62s min=310.27ms med=2.92s max=28.19s p(90)=21.19s p(95)=25.39s
      { expected_response:true }...: avg=7.62s min=310.27ms med=2.92s max=28.19s p(90)=21.19s p(95)=25.39s
    http_req_failed................: 0.00%  0 out of 304
    http_reqs......................: 304    2.301961/s

    EXECUTION
    iteration_duration.............: avg=7.63s min=310.4ms  med=2.98s max=28.19s p(90)=21.19s p(95)=25.39s
    iterations.....................: 304    2.301961/s
    vus............................: 1      min=1        max=40
    vus_max........................: 40     min=40       max=40

    NETWORK
    data_received..................: 280 kB 2.1 kB/s
    data_sent......................: 140 kB 1.1 kB/s



running (2m12.1s), 00/40 VUs, 304 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/40 VUs  1m50s